# BiFPN + 4 detector + CBAM + kmeans++ anchor + BiFPN
# parameters
nc: 2  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors coco:24,9, 37,12, 52,15 64,23, 81,19, 98,29 137,27, 199,41, 342,65
anchors:
  - [9,4, 3,9, 5,11]  # P2/4
  - [10,5, 18,8, 19,9]  # P3/8
  - [21,10, 25,11, 37,15]  # P4/16
  - [39,17, 49,19, 65,22]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4  Conv 128个卷积核，3x3卷积，步长2
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, BottleneckCSP, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 20*20 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 40*40 11
   [[-1, 6], 1, Concat_BiFPN, [1]],  # cat backbone P4  40*40 12
   [-1, 3, BottleneckCSP, [512, False]],  # 13  40*40
   [-1, 3, CBAM, [512]],  # 14 CBAM

   [ -1, 1, Conv, [512, 1, 1] ], #40*40 15
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  # 80*80 16
   [[-1, 4], 1, Concat_BiFPN, [1] ],  # cat backbone P3   80*80 17
   [ -1, 3, BottleneckCSP, [512, False] ],  # 18 (P3/8-small)  80*80
   [-1, 3, CBAM, [512]],  # 19 CBAM

   [-1, 1, Conv, [256, 1, 1]],  # 20  80*80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 21  160*160
   [[-1, 2], 1, Concat_BiFPN, [1]],  # 22 cat backbone P2  160 * 160
   [-1, 3, BottleneckCSP, [256, False]],  # 23 160*160
   [-1, 3, CBAM, [256]],  # 24 CBAM

   [ -1, 1, Conv, [ 256, 3, 2 ] ],  #25   80*80
   [[-1, 4, 18], 1, Concat_BiFPN, [1] ], #26 80*80
   [ -1, 3, BottleneckCSP, [256, False] ], #27 80*80
   [-1, 3, CBAM, [256]],  # 28 CBAM

   [-1, 1, Conv, [256, 3, 2]],  # 29 40 * 40
   [[-1, 6, 13], 1, Concat_BiFPN, [1]],  # 30 cat head P4 40*40
   [-1, 3, BottleneckCSP, [512, False]],  # 31 (P4/16-medium) 40*40
   [-1, 3, CBAM, [512]],  # 32 CBAM

   [-1, 1, Conv, [512, 3, 2]], # 33  20*20
   [[-1, 9], 1, Concat_BiFPN, [1]],  # 34 cat head P5  20*20
   [-1, 3, BottleneckCSP, [1024, False]],  # 35 (P5/32-large)  20*20

   [[23, 27, 31, 35], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
