# 4 SELayer
# parameters
# Model Summary: 271 layers, 2.26089e+07 parameters, 2.26089e+07 gradients, 53.8 GFLOPS
nc: 2  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors coco:24,9, 37,12, 52,15 64,23, 81,19, 98,29 137,27, 199,41, 342,65
anchors:
  - [10,4, 4,10, 18,8]  # P3/8
  - [20,9, 21,10, 35,14]  # P4/16
  - [14,36, 43,19, 19,48]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4 128个卷积核，3x3卷积，步长2
   [-1, 3, BottleneckCSP, [128]],  # 2
   [-1, 1, SELayer, [128, 4]],  # 3
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8
   [-1, 9, BottleneckCSP, [256]],  # 5
   [-1, 1, SELayer, [256, 4]],  # 6
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 9, BottleneckCSP, [512]],  # 8
   [-1, 1, SELayer, [512, 4]], # 9
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],  # 11
   [-1, 3, BottleneckCSP, [1024, False]],  # 12
   [-1, 1, SELayer, [1024, 4]], # 13
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 14 head P5
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4  16
   [-1, 3, BottleneckCSP, [512, False]],  # 17

   [-1, 1, Conv, [256, 1, 1]],  # 18 head P4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 19
   [[-1, 5], 1, Concat, [1]],  # 20 cat backbone P3
   [-1, 3, BottleneckCSP, [256, False]],  # 21 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],  # 22
   [[-1, 18], 1, Concat, [1]],  # 23 cat head P4
   [-1, 3, BottleneckCSP, [512, False]],  # 24 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # 25 cat head P5
   [-1, 3, BottleneckCSP, [1024, False]],  # 26 (P5/32-large)

   [[21, 24, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
