# BiFPN + 4 detector + CA + kmeans++ anchor + BiFPN*2 + C3
# parameters
# (no CA) Model Summary: 497 layers, 3.64318e+07 parameters, 3.64318e+07 gradients, 98.4 GFLOPS
# (CA) Model Summary: 529 layers, 3.65109e+07 parameters, 3.65109e+07 gradients
# (P2 to 9) Model Summary: 565 layers, 3.46765e+07 parameters, 3.46765e+07 gradients
nc: 2  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors coco:24,9, 37,12, 52,15 64,23, 81,19, 98,29 137,27, 199,41, 342,65
anchors:
  - [9,4, 3,9, 5,11]  # P2/4
  - [10,5, 18,8, 19,9]  # P3/8
  - [21,10, 25,11, 37,15]  # P4/16
  - [39,17, 49,19, 65,22]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2  [3, 48, 3]
   [-1, 1, Conv_CA, [128, 3, 2]],  # 1-P2/4  Conv 128个卷积核，3x3卷积，步长2 [48, 96, 3, 2]
   [-1, 9, C3, [128]], # 2 [96, 96, 2]
   [-1, 1, Conv_CA, [256, 3, 2]],  # 3-P3/8  [96, 192, 3, 2]
   [-1, 9, C3, [256]], # 4 [192, 192, 6]
   [-1, 1, Conv_CA, [512, 3, 2]],  # 5-P4/16  [192, 384, 3, 2]
   [-1, 9, C3, [512]],  # 6 [384, 384, 6]
   [-1, 1, Conv_CA, [1024, 3, 2]],  # 7-P5/32  [384, 768, 3, 2]
   [-1, 1, SPP, [1024, [5, 9, 13]]],  # 8 [768, 768, [5, 9, 13]]
   [-1, 3, C3, [1024, False]],  # 9  [768, 768, 2, False]
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10  [768, 384, 1, 1]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat_BiFPN, [512, 512]],  # 12 cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [ -1, 1, Conv, [256, 1, 1] ],  # 14
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  #  15
   [[-1, 4], 1, Concat_BiFPN, [256, 256] ],  # cat backbone P3 16
   [ -1, 3, C3, [256, False] ],  # (P3/8-small) 17

   [-1, 1, Conv, [128, 1, 1]],  # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 19
   [[-1, 2], 1, Concat_BiFPN, [128, 128]],  # cat backbone P2  20
   [-1, 3, C3, [128, False]],  # P2/4  21

   [ -1, 1, Conv, [ 256, 3, 2 ] ],  #22
   [[-1, 4, 17], 1, Concat_BiFPN, [256, 256] ], # 23
   [ -1, 3, C3, [256, False] ], # 24

   [-1, 1, Conv, [512, 3, 2]],  # 25
   [[-1, 6, 13], 1, Concat_BiFPN, [512, 512]],  # cat head P4  26
   [-1, 3, C3, [512, False]],  # (P4/16-medium)  27


   [-1, 1, Conv, [1024, 3, 2]], # 28
   [[-1, 9], 1, Concat_BiFPN, [1024, 1024]],  # cat head P5  29
   [-1, 3, C3, [1024, False]],  # (P5/32-large)  30

   # BiFPN-P2
   [ -1, 1, Conv, [ 512, 1, 1 ] ],  # [768, 384, 1, 1]  31
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  # 32
   [ [ -1, 27 ], 1, Concat_BiFPN, [ 512, 512 ] ],  # cat backbone P4  33
   [ -1, 3, C3, [ 512, False ] ],  # 34

   [ -1, 1, Conv, [ 256, 1, 1 ] ],  # 35
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  #  36
   [ [ -1, 24 ], 1, Concat_BiFPN, [ 256, 256 ] ],  # cat backbone P3  37
   [ -1, 3, C3, [ 256, False ] ],  # (P3/8-small)  38

   [ -1, 1, Conv, [ 128, 1, 1 ] ],  # 39
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  # 40
   [ [ -1, 21 ], 1, Concat_BiFPN, [ 128, 128 ] ],  # cat backbone P2  41
   [ -1, 3, C3, [ 128, False ] ],  # P2/4  42

   [ -1, 1, Conv, [ 256, 3, 2 ] ],  # 43
   [ [ -1, 24, 38 ], 1, Concat_BiFPN, [ 256, 256 ] ], # 44
   [ -1, 3, C3, [ 256, False ] ], # 45

   [ -1, 1, Conv, [ 512, 3, 2 ] ],  # 46
   [ [ -1, 27, 34 ], 1, Concat_BiFPN, [ 512, 512 ] ],  # cat head P4  47
   [ -1, 3, C3, [ 512, False ] ],  # (P4/16-medium)  48

   [ -1, 1, Conv, [ 1024, 3, 2 ] ], # 49
   [ [ -1, 30 ], 1, Concat_BiFPN, [ 1024, 1024 ] ],  # cat head P5  50
   [ -1, 3, C3, [ 1024, False ] ],  # (P5/32-large)  51

   [[42, 45, 48, 51], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
