# BiFPN + 4 detector + CBAM + kmeans++ anchor + BiFPN
# parameters
# Model Summary: 557 layers, 1.49089e+07 parameters, 1.49089e+07 gradients, 37.8 GFLOPS
nc: 2  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors coco:24,9, 37,12, 52,15 64,23, 81,19, 98,29 137,27, 199,41, 342,65
anchors:
  - [9,4, 3,9, 5,11]  # P2/4
  - [10,5, 18,8, 19,9]  # P3/8
  - [21,10, 25,11, 37,15]  # P4/16
  - [39,17, 49,19, 65,22]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2  [3, 48, 3]
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4  Conv 128个卷积核，3x3卷积，步长2 [48, 96, 3, 2]
   [-1, 3, C3Ghost, [128]], # 2 [96, 96, 2]
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8  [96, 192, 3, 2]
   [-1, 9, C3Ghost, [256]], # 4 [192, 192, 6]
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16  [192, 384, 3, 2]
   [-1, 9, C3Ghost, [512]],  # 6 [384, 384, 6]
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32  [384, 768, 3, 2]
   [-1, 1, SPP, [1024, [5, 9, 13]]],  # 8 [768, 768, [5, 9, 13]]
   [-1, 3, C3Ghost, [1024, False]],  # 9  [768, 768, 2, False]
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10  [768, 384, 1, 1]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat_BiFPN, [512, 512]],  # 12 cat backbone P4
   [-1, 3, C3Ghost, [512, False]],  # 13
   [-1, 3, CBAM, [512]],  # 14 CBAM

   [ -1, 1, Conv, [256, 1, 1] ],  # 15
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],  #  16
   [[-1, 4], 1, Concat_BiFPN, [256, 256] ],  # 17 cat backbone P3
   [ -1, 3, C3Ghost, [256, False] ],  # 18 (P3/8-small)
   [-1, 3, CBAM, [256]],  # 19 CBAM

   [-1, 1, Conv, [128, 1, 1]],  # 20  80*80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 21
   [[-1, 2], 1, Concat_BiFPN, [128, 128]],  # 22 cat backbone P2
   [-1, 3, C3Ghost, [128, False]],  # 23 P2/4
   [-1, 3, CBAM, [128]],  # 24 CBAM

   [ -1, 1, Conv, [ 256, 3, 2 ] ],  #25
   [[-1, 4, 18], 1, Concat_BiFPN, [256, 256] ], # 26
   [ -1, 3, C3Ghost, [256, False] ], # 27
   [-1, 3, CBAM, [256]],  # 28 CBAM

   [-1, 1, Conv, [512, 3, 2]],  # 29
   [[-1, 6, 13], 1, Concat_BiFPN, [512, 512]],  # 30 cat head P4
   [-1, 3, C3Ghost, [512, False]],  # 31 (P4/16-medium)
   [-1, 3, CBAM, [512]],  # 32 CBAM

   [-1, 1, Conv, [1024, 3, 2]], # 33
   [[-1, 9], 1, Concat_BiFPN, [1024, 1024]],  # 34 cat head P5
   [-1, 3, C3Ghost, [1024, False]],  # 35 (P5/32-large)

   [[23, 27, 31, 35], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
